<?php /** @noinspection GrazieInspection */

use App\VK\Chat;
use Hopex\VkSdk\Formatters\JsonLogFormatter;

return [

    /*
    |--------------------------------------------------------------------------
    | Маршрутизация
    |--------------------------------------------------------------------------
    | ENTRY
    |    URI адрес, определяющий первоначальный маршрут в приложении для всех
    |    входящих запросов API.
    |--------------------------------------------------------------------------
    */

    'routes' => [
        'entry' => 'connect',
    ],

    /*
    |--------------------------------------------------------------------------
    | Параметры исходящих подключений
    |--------------------------------------------------------------------------
    | COMMON
    |    Базовые настройки API.
    |
    | COMMON.ENDPOINT
    |    Базовая часть адреса для отправки API запроса на сторону
    |    ВКонтакте.
    |
    | COMMON.VERSION
    |    Используемая версия VK API. Использование этого параметра
    |    применяет некоторые изменения в формате ответа различных методов.
    |--------------------------------------------------------------------------
    | GROUP
    |    Политика конфигурации для групп.
    |
    | GROUP.CONFIRMATION
    |    Код, необходимый для привязки и дальнейшего получения уведомлений.
    |
    | GROUP.SECRET
    |    Произвольная строка до 50 символов, может включать латинские буквы и
    |    цифры. Заданный вами секретный ключ будет передаваться с каждым
    |    уведомлением от сервера в отдельном поле <secret>. Это позволит вам
    |    достоверно определять, что уведомление пришло именно от сервера ВК.
    |    Чтобы исключить возможность подделки запросов, пожалуйста, не
    |    публикуйте значение секретного ключа в открытом доступе.
    |
    | GROUP.TOKEN
    |    Ключ доступа группы.
    |
    | GROUP.SECURE
    |    Определяет необходимость проверки поля секретного ключа для всех
    |    входящих запросов сервера, выполненных от лица текущей группы.
    |--------------------------------------------------------------------------
    */

    // TODO: исправить документацию для api и groups
    'api' => [
        'auth' => 'https://oauth.vk.com',
        'endpoint' => 'https://api.vk.com/method',
        'version' => '5.131',
    ],

    'groups' => [
        '84942932' => [
            'confirmation' => '28ec36c3',
            'token' => 'vk1.a.-U95XUjpt2OxcSqyPydks69FwG1fAHxY5CF7pUFC-d0oG9bY4ld2HO23VQCBF8xbrS2gLDE2QXyLSH6jsCaGw5lGc2M-n8aAbwToCGLp97LiS5Lf3Ha1En3LQshkdLlZkqKS80METKyr_3nSIBF4GJLAxZNvnSd12hXe3PYZAG0oTIkVPgdguVrbs8EEcAGv',
            'secret' => [
                'code' => '745cc77d276cf36c694e',
                'verify' => true,
            ],
            'events' => Chat::class,
            'allow_retry_events' => true,
        ],
    ],

    'apps' => [
        '7967757' => [
            'token' => 'b89c4892b89c4892b89c4892aeb8e5dc9fbb89cb89c4892d9c7b14801fb3358d6dcd092',
            'secret' => 'OaQA1ddYuF2PLGAGKOjd',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Логирование
    |--------------------------------------------------------------------------
    | ENABLED
    |    Определяет необходимость ведения логирования.
    |--------------------------------------------------------------------------
    | CHANNELS
    |    Настраиваемые каналы для ведения логирования.
    |
    | CHANNELS.EXCEPTION
    |    Канал логирования исключений SDK.
    |--------------------------------------------------------------------------
    */

    'logging' => [
        'enabled' => true,
        'channels' => [
            'exception' => [
                'name' => 'vk-sdk',
                'driver' => 'daily',
                'path' => storage_path('logs/vk-sdk/exceptions.log'),
                'level' => env('LOG_LEVEL', 'debug'),
                'permissions' => 0755,
                'locking' => true,
                'days' => 30,
                'tap' => JsonLogFormatter::class,
            ],
        ],
    ],
];
